tap "kaplanelad/tap", trusted: true
tap "lihaoyun6/tap", trusted: true
tap "sdkman/tap", trusted: true
# Search tool like grep, but optimized for programmers
brew "ack"
# Run your GitHub Actions locally
brew "act"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Simple, modern, secure file encryption
brew "age"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Browser automation CLI for AI agents
brew "agent-browser"
# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Top-like interface for container metrics
brew "ctop"
# Manage AI coding skills and documentation context
brew "ctx7"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Portable devkit for CI/CD pipelines
brew "dagger"
# Tool for exploring each layer in a docker image
brew "dive"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Small git utilities
brew "git-extras"
# Git extension for versioning large files
brew "git-lfs"
# Audit git repos for secrets
brew "gitleaks"
# Gorgeous metric visualizations and dashboards for timeseries databases
brew "grafana"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Cross-platform TUI database management tool
brew "lazysql"
# Pager program similar to more
brew "less"
# Find what models run on your hardware
brew "llmfit"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Mac App Store command-line interface
brew "mas"
# Deep clean and optimize your Mac
brew "mole"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Modern replacement for ps written in Rust
brew "procs"
# Service monitoring system and time series database
brew "prometheus"
# Extremely fast tool to remove dupes and other lint from your filesystem
brew "rmlint"
# Intuitive find & replace CLI
brew "sd"
# Open agent skills ecosystem
brew "skills"
# Graphical command-line client for SSH
brew "sshs"
# Cross-shell prompt for astronauts
brew "starship"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Upgrade all the things
brew "topgrade"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Intercept any risky patterns (default or defined by you) and prompt you a small challenge for double verification
brew "kaplanelad/tap/shellfirm"
# SDKMAN! the Software Development Kit Manager
brew "sdkman/tap/sdkman-cli"
# Stand alone ad blocker
cask "adguard"
# Image editing and design software
cask "affinity"
# Get the battery level of all your devices on your Mac.
cask "lihaoyun6/tap/airbattery"
# Official eID-Client of the Federal Government of Germany
cask "ausweisapp"
# Integrated CAD, CAM, CAE, and PCB software
cask "autodesk-fusion"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# 3D model slicing software for 3D printers, maintained by Bambu Lab
cask "bambu-studio"
# Menu bar icon organiser
cask "bartender"
# Desktop password and login vault
cask "bitwarden"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Hard disk backup and cloning utility
cask "carbon-copy-cloner"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Terminal-based AI coding assistant
cask "claude-code"
# Ghostty-based terminal with vertical tabs and notifications for AI coding agents
cask "cmux"
# Disk space visualiser
cask "daisydisk"
# API documentation browser and code snippet manager
cask "dash@6"
# Databases and SQL IDE
cask "datagrip"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Voice and text chat software
cask "discord"
# Posture monitoring app
cask "dorso"
# Downloads videos from different websites
cask "downie"
# Assign keys, and then decorate and label them
cask "elgato-stream-deck"
# DJ software suite
cask "engine-dj"
# Calendar software
cask "fantastical"
# Audio playback
cask "farrago"
# Web browser
cask "firefox@developer-edition"
# Focusrite interface controller for devices of the 4th generation and newer
cask "focusrite-control-2"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# GitHub notifications on your menu bar
cask "gitify"
# Free and open-source media player
cask "iina"
# Software for iLok devices
cask "ilok-license-manager"
# iPhone management application
cask "imazing"
# Controller for Insta360 webcams
cask "insta360-link-controller"
# Java IDE by JetBrains
cask "intellij-idea"
# System monitoring app
cask "istat-menus"
# File archiver
cask "keka"
# Host-based application firewall
cask "little-snitch"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Break time reminder app
cask "lookaway"
# Cable-free audio router
cask "loopback"
# Adaptive brightness for external displays
cask "lunar"
# Mouse utility to add gesture functions and smooth scrolling to 3rd party mice
cask "mac-mouse-fix"
# Helps you learn to play your instrument
cask "melodics"
# Spreadsheet software
cask "microsoft-excel"
# Presentation software
cask "microsoft-powerpoint"
# Word processor
cask "microsoft-word"
# Display MIDI signals going in and out of your computer
cask "midi-monitor"
# Harmonic mixing for DJs and music producers
cask "mixed-in-key"
# Port of MP3Gain and AACGain
cask "mp3gain-express"
# Tool for editing metadata of audio files including MP3, FLAC, OGG, and more
cask "mp3tag"
# Administration tool for Native Instruments products
cask "native-access"
# Tool to scan and monitor the network
cask "network-radar"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Get up and running with large language models locally
cask "ollama-app"
# AI coding agent desktop client
cask "opencode-desktop"
# Replacement for Docker Desktop
cask "orbstack"
# PDF reader, editor and annotator
cask "pdf-expert"
# Converts and edits video, audio or image files
cask "permute"
# IDE for professional Python development
cask "pycharm"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# Free Dj app to prepare and manage your music files
cask "rekordbox"
# Real-time Noise Suppression Plugin
cask "rnnoise"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Sync and backup service to Synology NAS drives
cask "synology-drive"
# Assistant to generate image previews of formats like HEIC and HEVC
cask "synology-image-assistant"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Utility to change the default backup interval of Time Machine
cask "timemachineeditor"
# Automatic time-tracking application
cask "timemator"
# Font manager application
cask "typeface"
# Google Chromium, sans integration with Google
cask "ungoogled-chromium"
# Utility that shows the latest app updates
cask "updatest"
# Voice to text app
cask "voiceink"
# Real-time voice changer and soundboard
cask "voicemod"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# JavaScript IDE
cask "webstorm"
# Native desktop client for WhatsApp
cask "whatsapp"
# Full-featured companion app to the YubiKey
cask "yubico-authenticator"
mas "Cascadea", id: 1432182561
mas "Compressor", id: 424390742
mas "Cursor Pro", id: 1447043133
mas "DaftCloud", id: 1320450034
mas "Endel", id: 1346247457
mas "Final Cut Pro", id: 424389933
mas "Gestimer", id: 6447125648
mas "Keystroke Pro", id: 1572206224
mas "Klack", id: 6446206067
mas "Logic Pro", id: 634148309
mas "Lumaly", id: 1573979983
mas "Mirror Magnet", id: 1563698880
mas "Motion", id: 434290957
mas "Noir", id: 1592917505
mas "Octotree", id: 1457450145
mas "Pages", id: 361309726
mas "Reeder", id: 1529448980
mas "Refined GitHub", id: 1519867270
mas "Shoop Cashback & Gutscheine", id: 1568244961
mas "SnippetsLab", id: 1006087419
mas "Stecker", id: 6447288587
mas "Steuerbot", id: 1352913300
mas "Streaks", id: 963034692
mas "Structured", id: 1499198946
mas "Things", id: 904280696
mas "UnTrap", id: 1637438059
mas "VPN Unlimited®", id: 694633015
mas "WalkingMate", id: 6754256683
mas "WaterMinder", id: 1415257369
mas "Xcode", id: 497799835
vscode "ban.spellright"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "circledev.glsl-canvas"
vscode "continue.continue"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "oderwat.indent-rainbow"
vscode "raczzalan.webgl-glsl-editor"
vscode "redhat.vscode-yaml"
vscode "seatonjiang.gitmoji-vscode"
vscode "shardulm94.trailing-spaces"
vscode "streetsidesoftware.code-spell-checker"
vscode "vivaxy.vscode-conventional-commits"
npm "corepack"
npm "pnpm"
