tap "charmbracelet/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jorgerojas26/lazysql"
tap "kaplanelad/tap"
tap "oven-sh/bun"
tap "sdkman/tap"
tap "skalt/git-cc"
brew "ack"
brew "antidote"
brew "openssl@3"
brew "bat"
brew "bat-extras"
brew "btop"
brew "readline"
brew "sqlite"
brew "xz"
brew "python@3.12"
brew "chezmoi"
brew "cliclick"
brew "coreutils"
brew "ctop"
brew "curl"
brew "docker"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "gitleaks"
brew "gum"
brew "helix"
brew "httpie"
brew "kondo"
brew "lazydocker"
brew "lazygit"
brew "lsd"
brew "mackup"
brew "mas"
brew "navi"
brew "neovim"
brew "noti"
brew "nvm"
brew "ollama", restart_service: :changed
brew "openssh"
brew "osv-scanner"
brew "pidof"
brew "pipx"
brew "pkgconf"
brew "pnpm"
brew "procs"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rename"
brew "ripgrep"
brew "rmlint"
brew "sd"
brew "sshs"
brew "starship"
brew "switchaudio-osx"
brew "tcl-tk@8"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "topgrade"
brew "tree"
brew "trivy"
brew "wget"
brew "xplr"
brew "yamllint"
brew "yq"
brew "yt-dlp"
brew "zlib"
brew "zoxide"
brew "charmbracelet/tap/freeze"
brew "charmbracelet/tap/mods"
brew "jorgerojas26/lazysql/lazysql"
brew "kaplanelad/tap/shellfirm"
brew "oven-sh/bun/bun"
brew "sdkman/tap/sdkman-cli"
brew "skalt/git-cc/git-cc"
cask "adguard"
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "alfred"
cask "appcleaner"
cask "balenaetcher"
cask "bartender"
cask "batteries"
cask "boop"
cask "bruno"
cask "chatgpt"
cask "commander-one"
cask "daisydisk"
cask "dash@6"
cask "datagrip"
cask "deepl"
cask "discord"
cask "downie"
cask "drawio"
cask "fantastical"
cask "figma"
cask "firefox@developer-edition"
cask "font-jetbrains-mono-nerd-font"
cask "fork"
cask "garagesale"
cask "ghostty"
cask "gitify"
cask "google-chrome"
cask "gpg-suite"
cask "hazeover"
cask "ilok-license-manager"
cask "imazing"
cask "intellij-idea"
cask "istat-menus"
cask "keka"
cask "ledger-live"
cask "little-snitch"
cask "logi-options+"
cask "lookaway"
cask "lunar"
cask "mactex-no-gui"
cask "macupdater"
cask "mission-control-plus"
cask "mixed-in-key"
cask "mos"
cask "msty"
cask "muzzle"
cask "native-access"
cask "network-radar"
cask "obsidian"
cask "onyx"
cask "orbstack"
cask "paletro"
cask "pdf-expert"
cask "permute"
cask "pycharm"
cask "raspberry-pi-imager"
cask "rekordbox"
cask "rocket"
cask "sf-symbols"
cask "shifty"
cask "sip"
cask "sketch"
cask "spamsieve"
cask "spline"
cask "staruml"
cask "synology-image-assistant"
cask "tabby"
cask "teamviewer"
cask "tex-live-utility"
cask "texifier"
cask "timemachineeditor"
cask "timemator"
cask "typeface"
cask "typora"
cask "unclutter"
cask "vmware-fusion"
cask "vscodium"
cask "webstorm"
cask "whatsapp"
cask "yubico-authenticator"
cask "zotero"
mas "AusweisApp", id: 948660805
mas "Bitwarden", id: 1352778147
mas "Cascadea", id: 1432182561
mas "Compressor", id: 424390742
mas "Cursor Pro", id: 1447043133
mas "DaftCloud", id: 1320450034
mas "Dropover", id: 1355679052
mas "Dynamo", id: 1445910651
mas "eduVPN", id: 1317704208
mas "Endel", id: 1346247457
mas "Final Cut Pro", id: 424389933
mas "Gestimer", id: 6447125648
mas "Goodnotes", id: 1444383602
mas "Hand Mirror", id: 1502839586
mas "Keystroke Pro", id: 1572206224
mas "Klack", id: 6446206067
mas "LanguageTool", id: 1534275760
mas "Logic Pro", id: 634148309
mas "Looking Glass", id: 1602004436
mas "Lumaly", id: 1573979983
mas "Magnet", id: 441258766
mas "Mirror Magnet", id: 1563698880
mas "Motion", id: 434290957
mas "Noir", id: 1592917505
mas "Reeder", id: 1529448980
mas "SnippetsLab", id: 1006087419
mas "Streaks", id: 963034692
mas "Structured", id: 1499198946
mas "Theine", id: 955848755
mas "Things", id: 904280696
mas "UnTrap", id: 1637438059
mas "VPN Unlimited®", id: 694633015
mas "WaterMinder", id: 1415257369
mas "Xcode", id: 497799835
