tap "1password/tap"
tap "ameshkov/tap"
tap "ankitpokhrel/jira-cli"
tap "apple/apple", "http://github.com/apple/homebrew-apple"
tap "aws/tap"
tap "charmbracelet/tap"
tap "derailed/k9s"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "jesseduffield/lazynpm"
tap "jzaleski/jzaleski"
tap "kaplanelad/tap"
tap "lencx/nofwl"
tap "mvndaemon/mvnd"
tap "oven-sh/bun"
tap "real-aazam/aazam"
tap "romkatv/powerlevel10k"
tap "skalt/git-cc"
tap "snyk/tap"
tap "tako8ki/tap"
tap "wtfutil/wtfutil"
brew "ack"
brew "act"
brew "actionlint"
brew "age"
brew "xz"
brew "python@3.12"
brew "ansible"
brew "ansible-lint"
brew "antidote"
brew "asciinema"
brew "python@3.11"
brew "awscli"
brew "bash"
brew "bat"
brew "bat-extras"
brew "gcc"
brew "btop"
brew "chezmoi"
brew "cliclick"
brew "cmake"
brew "cmatrix"
brew "ruby"
brew "cocoapods"
brew "coreutils"
brew "cowsay"
brew "ctop"
brew "curl"
brew "dart-sdk"
brew "delve"
brew "dive"
brew "dockutil"
brew "entr"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "figlet"
brew "fortune"
brew "freerdp"
brew "fzf"
brew "geckodriver"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "git-extras"
brew "git-flow-avh"
brew "git-lfs"
brew "gitlab-ci-local"
brew "gitleaks"
brew "glab"
brew "glow"
brew "go"
brew "gobject-introspection"
brew "golangci-lint"
brew "openjdk"
brew "gradle"
brew "gradle-profiler"
brew "graphviz"
brew "groovy"
brew "grpcurl"
brew "gum"
brew "helix"
brew "helm"
brew "http-server"
brew "httpie"
brew "imagemagick"
brew "jmeter"
brew "pandoc"
brew "jupyterlab"
brew "k9s"
brew "kondo"
brew "kotlin"
brew "krew"
brew "kubectx"
brew "lego"
brew "lolcat"
brew "lsd"
brew "mackup"
brew "mailsy"
brew "mas"
brew "maven"
brew "minikube"
brew "molecule"
brew "navi"
brew "ncdu"
brew "neovim"
brew "noti"
brew "npm-check-updates"
brew "oha"
brew "ollama"
brew "openapi-generator"
brew "openshift-cli"
brew "openssh"
brew "tidy-html5"
brew "php"
brew "pidof"
brew "plantuml"
brew "poetry"
brew "pop"
brew "procs"
brew "protobuf"
brew "pwgen"
brew "python@3.10"
brew "python@3.9"
brew "qemu"
brew "rclone"
brew "rename"
brew "ripgrep"
brew "rmlint"
brew "rsync"
brew "rust"
brew "scala"
brew "sd"
brew "shellcheck"
brew "sl"
brew "speedtest-cli"
brew "sshs"
brew "starship"
brew "swagger-codegen"
brew "swiftformat"
brew "swiftlint"
brew "switchaudio-osx"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "topgrade"
brew "trash"
brew "tree"
brew "ttyd"
brew "vhs"
brew "virtualenv"
brew "virtualenvwrapper"
brew "wget"
brew "wtfutil"
brew "xplr"
brew "yamllint"
brew "ykman"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "ameshkov/tap/dnslookup"
brew "ankitpokhrel/jira-cli/jira-cli"
brew "charmbracelet/tap/freeze"
brew "charmbracelet/tap/mods"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "heroku/brew/heroku"
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazygit/lazygit"
brew "kaplanelad/tap/shellfirm"
brew "mvndaemon/mvnd/mvnd"
brew "oven-sh/bun/bun"
brew "real-aazam/aazam/hollywood"
brew "skalt/git-cc/git-cc"
brew "snyk/tap/snyk"
brew "tako8ki/tap/gobang"
cask "1password"
cask "adguard"
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "alfred"
cask "android-studio"
cask "anki"
cask "anythingllm"
cask "appcleaner"
cask "aqua"
cask "arturia-software-center"
cask "aws-vault"
cask "balenaetcher"
cask "balsamiq-wireframes"
cask "bartender"
cask "bitwarden"
cask "blisk"
cask "boop"
cask "bruno"
cask "clion"
cask "commander-one"
cask "daisydisk"
cask "dash@6"
cask "datagrip"
cask "dataspell"
cask "dbngin"
cask "deepl"
cask "devcleaner"
cask "devpod"
cask "discord"
cask "docker"
cask "downie"
cask "drawio"
cask "fantastical"
cask "figma"
cask "firefox@developer-edition"
cask "fleet"
cask "focusrite-control"
cask "font-jetbrains-mono-nerd-font"
cask "fork"
cask "garagesale"
cask "gitify"
cask "goland"
cask "google-chrome"
cask "gpg-suite"
cask "hashicorp-vagrant"
cask "hazeover"
cask "ilok-license-manager"
cask "imazing"
cask "intellij-idea"
cask "istat-menus"
cask "izotope-product-portal"
cask "keka"
cask "kekaexternalhelper"
cask "kitty"
cask "languagetool"
cask "ledger-live"
cask "little-snitch"
cask "logi-options-plus"
cask "loupedeck"
cask "lunar"
cask "mactex"
cask "macupdater"
cask "miniconda"
cask "minishift"
cask "mission-control-plus"
cask "mos"
cask "muzzle"
cask "native-access"
cask "network-radar"
cask "numi"
cask "obsidian"
cask "onyx"
cask "paletro"
cask "pdf-expert"
cask "permute"
cask "protopie"
cask "pycharm"
cask "raspberry-pi-imager"
cask "rekordbox"
cask "rocket"
cask "rotato"
cask "screens"
cask "sf-symbols"
cask "shifty"
cask "sip"
cask "sketch"
cask "softube-central"
cask "spline"
cask "staruml"
cask "tabby"
cask "teamviewer"
cask "texifier"
cask "thingsmacsandboxhelper"
cask "timemachineeditor"
cask "timemator"
cask "typeface"
cask "typora"
cask "unclutter"
cask "vagrant"
cask "visual-studio-code"
cask "waves-central"
cask "webstorm"
cask "whatsapp"
cask "writerside"
cask "xquartz"
cask "yubico-authenticator"
cask "yubico-yubikey-manager"
cask "zoom"
cask "zotero"
mas "1Password for Safari", id: 1569813296
mas "AusweisApp", id: 948660805
mas "Cascadea", id: 1432182561
mas "Compressor", id: 424390742
mas "Cursor Pro", id: 1447043133
mas "Developer", id: 640199958
mas "Dropover", id: 1355679052
mas "Dynamo", id: 1445910651
mas "eduVPN", id: 1317704208
mas "Endel", id: 1346247457
mas "Fabula", id: 1503214451
mas "Final Cut Pro", id: 424389933
mas "Flow", id: 1423210932
mas "GarageBand", id: 682658836
mas "Gestimer", id: 6447125648
mas "Goodnotes", id: 1444383602
mas "Hand Mirror", id: 1502839586
mas "Keynote", id: 409183694
mas "Keystroke Pro", id: 1572206224
mas "Logic Pro", id: 634148309
mas "Looking Glass", id: 1602004436
mas "Magnet", id: 441258766
mas "MainStage", id: 634159523
mas "Mirror Magnet", id: 1563698880
mas "Motion", id: 434290957
mas "Noir", id: 1592917505
mas "Numbers", id: 409203825
mas "Page Screenshot for Safari", id: 1472715727
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "PayPal Honey", id: 1472777122
mas "Reeder", id: 1529448980
mas "SnippetsLab", id: 1006087419
mas "Streaks", id: 963034692
mas "Structured", id: 1499198946
mas "TestFlight", id: 899247664
mas "Theine", id: 955848755
mas "Things", id: 904280696
mas "VPN Unlimited®", id: 694633015
mas "WaterMinder", id: 1415257369
mas "Xcode", id: 497799835
vscode "42crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "ajithgopi.css-snippets"
vscode "alefragnani.project-manager"
vscode "ban.spellright"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.path-intellisense"
vscode "continue.continue"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "janne252.fontawesome-autocomplete"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-de"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "nash.awesome-flutter-snippets"
vscode "oderwat.indent-rainbow"
vscode "rangav.vscode-thunder-client"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "seatonjiang.gitmoji-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-german"
vscode "tamasfe.even-better-toml"
vscode "tim-koehler.helm-intellisense"
vscode "tomoki1207.pdf"
vscode "vue.volar"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "zignd.html-css-class-completion"
